{"review_id":"fdiNeiN_hoCxCMy2wTRW9g","user_id":"w31MKYsNFMrjhWxxAb5wIw","business_id":"eU_713ec6fTGNO4BegRaww","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I'll be the first to admit that I was not excited about going to La Tavolta. Being a food snob, when a group of friends suggested we go for dinner I looked online at the menu and to me there was nothing special and it seemed overpriced.  Im also not big on ordering pasta when I go out. Alas, I was outnumbered. Thank goodness! I ordered the sea bass special. It was to die for. Cooked perfectly, seasoned perfectly, perfect portion. I can not say enough good things about this dish. When the server asked how it was he seemed very proud of the dish and said, \" doesn't she (the chef) do an incredible job?\" She does. \n\nMy hubby got the crab tortellini and also loved his. I heard \"mmmm this is so good\" from all around the table. Our waiter was super nice and even gave us free desserts because we were some of the last people in the restaurant. Service was very slow and the place was PACKED but we had our jugs of wine and a large group with good conversation so it didn't seem to bother anyone.\n\nSo-\n\nDo order the calamari and fried zucchini appetizers. Leave out the mussels. \n\nIf they have the sea bass special, I highly recommend it. The chicken parm and crab tortellini were also very good and very big. The chicken Romano was a bit bland. The house salads were teeny. \n\nDo make a reservation but still expect to wait for your food. Go with a large group of people and plan for it to be loud. Don't go with a date unless you're fighting and don't feel like hearing anything they have to say.  Ask to sit in the side room if it's available.","date":"2013-01-20 13:25:59"}
{"review_id":"G7XHMxG0bx9oBJNECG4IFg","user_id":"jlu4CztcSxrKx56ba1a5AQ","business_id":"3fw2X5bZYeW9xCz_zGhOHg","stars":3.0,"useful":5,"funny":4,"cool":5,"text":"Tracy dessert had a big name in Hong Kong and the one in First Markham place has been here for many years now! \n\nCame in for some Chinese dessert, and I must say their selection has increased tremendously over the years. I might as well add that the price has also increased tremendously as well. The waitress gave us tea, which I could taste had red date in it. Fancy!\n\nA simple taro with coconut with tapioca pearls was like $5.25 or something. Basically all the desserts were more than $5. That's crazy! I can literally just make this dessert at home and for a bowl, it would probably cost like $0.50. A few years ago, I think I can still get it for like $3-$4, which is more reasonable, but wow, more than $5 is a little over the top for this dessert. Though I must say, it is Tracy Dessert, and they are a little more on the expensive side. \n\nI also saw other items on the menu like fish balls, chicken wings, shaved ice. My friend got a mango drink with fresh mango in it! \n\nI'm also surprised how many people come to Tracy Dessert after work. We came on a Sunday and the tables were always filled. I think the amount of tables they had were just perfect because no one really waited for seats for a long time, but the tables kept filling up once a table was finished.","date":"2016-05-07 01:21:02"}
{"review_id":"rEITo90tpyKmEfNDp3Ou3A","user_id":"6Fz_nus_OG4gar721OKgZA","business_id":"6lj2BJ4tJeu7db5asGHQ4w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We've been a huge Slim's fan since they opened one up in Texas about two years ago when we used to live there. This place never disappoints. They even have great salads and grilled chicken. Plus they have fresh brewed sweet tea, it's the best!","date":"2017-05-26 01:23:19"}
{"review_id":"bjD0Dqn3k-fi00BXatrytg","user_id":"1fi6x4tnJtlVWaJmoIO9XA","business_id":"XTzKRvWciP_BZ9imk8mmPQ","stars":1.0,"useful":5,"funny":1,"cool":0,"text":"I tried this place because my girls are away for a month, and I REALLY wanted to try to wait until they came back, because NOBODY can hold a candle to them, but my toes were desperate.  When I went in, they were almost twice what I usually pay to begin with.  Then, before starting the pedicure, I specifically told them I already had gel polish on my toes.  They didn't tell me right then and there \"that will be an extra $5'.  No, they waited until it was time to pay, and not only charged me for that, but they charged me all kinds of extra fees that I didn't even ask for!  I had also informed the girl that my toenail was loose and needed gluing.  While I was looking at my phone, all of a sudden I felt this sensation, and she RIPPED OFF MY TOENAIL!!!!  Without even asking me!!!!!!  So then she had another girl come and put acrylic on there since the nail underneath was only 1\/2 grown.  Again, they didn't tell me how much this would be, or even ask my permission, they just charged me at the end.  \n\nThe added stone 'massage' was barely a massage!  She rubbed the stones up my lower legs a couple times, and that was it.  It lasted about 30 seconds.   And when I asked for a design, I'm used to getting a board with a bunch of designs to choose from.  She didn't even ask me what I wanted, she just painted a few lines on my two toes and then charge me 5 MORE dollars for that! \n\nUgh, I don't care HOW ugly my toes look next time, I will NEVER go anywhere else besides Bella Nails again, they ROCK!!!!!!!  This place was appalling.  I didn't want to make a scene, so I just paid the money, but I will NEVER go back!!!!!!!","date":"2014-06-27 21:32:31"}
{"review_id":"CelUWzp-GnJIiiV1mDUb-g","user_id":"tFICmdLtwgFIRcwtlbYQOg","business_id":"CDpoJiqgM04wqQTZ6QkTqQ","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Love this place downtown but the Scottsdale location has no manners. Sat at bar for 10 min while bartender ignored us. No menu, no water. We walked out and they could have cared less.","date":"2015-12-05 02:37:03"}
{"review_id":"eed44nI0eZ4BGKtKXsRJhQ","user_id":"tAcB1ZohRtjozsymvqqHzQ","business_id":"m7ommfJFalI47UksyX04Iw","stars":1.0,"useful":6,"funny":2,"cool":1,"text":"Met a friend for dinner there tonight. The server only brought us one menu. After she brought us a couple of Cokes she didn't come to our table for 20 mins. After trying to get her attention a few times when she walked by we decided to just order off the bartender. We received the starters and the mains at the same time. The wings, brisket, and mac and cheese were alright at best. At this point we hadn't seen the server since she brought the food, so we had to go to the bar for more napkins and refills on the Cokes. The most we actually saw our server was when she hovered over us as we put the tip into the handheld credit card terminal. \n\nFood was somewhere between okay and decent. Service was somewhere between piss poor and terrible.","date":"2014-09-25 08:15:44"}
{"review_id":"UoFxqWXBluvS4Q32spb8Lg","user_id":"5rWm6uBPeewOiml4pcqp3w","business_id":"m7ommfJFalI47UksyX04Iw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Another solid BBQ place in Calgary. This is definitely a great place to go if you are craving something smokey and delicious. \n\nI actually noticed this place because I wandered by when I was walking downtown and it's impossible to miss that lovely smokey\/BBQ smell if you're on the block. However, it looks kind of like a hole in the wall. The entrance doesn't look like it's been updated in years, and that's ok because it just adds character. The entire decor is wood\/country (to include buffalo head on the wall) and there is also a downstairs where there is live music on the weekends.\n\nOk onto the food. I have been here a couple of times now, so I think I can comment on the menu pretty well. My friends and I have ordered the brisket, the catfish, the veggie burger, the mac n cheese, the cesar salad, the chili, and the garlic fries. If I had to review this place based on the delicious and garliciness of their fries, this would be a 5-star review hands down. I mean, seriously, vampires beware, but everyone else should enjoy a-plenty.\n\nThe portion sizes are huge, so go hungry or be prepared for a to-go box (granted every time I've gone I have loved the food so much that I ate the entire meal.) \n\nI bet at this point in time you are wondering why I am only giving this place 4 stars then? Well, not everything is as amazing as those garlic fries. The bourbon apples are fairly tasteless, the chili is ok (the meat was very tough), and the service is also just ok. However, the catfish is delightful, the mac and cheese is also delicious, and the brisket is quality. \n\nThe specialty cocktails are also pretty good, and the beer prices are pretty decent. This is a great place to go for a long lunch, after dinner drink, or even a weekend brunch. There are vegetarian options on the menu (if you can ignore the buffalo head on the wall) and I believe even a few gluten-free options as well. It's a fairly good place to go with a large group, just make sure to call ahead. \n\nAll in all, like I said earlier, a great place for good times and smokey flavor.","date":"2014-10-27 04:22:34"}
{"review_id":"9cW1B-T6M3ER3_rH_36h9Q","user_id":"D-vYE3HILl7Qk1UhYqZXYQ","business_id":"6sATfFam9_q9uod0I2aCsg","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I really enjoyed my visit here.\nEverything was visually appealing to me.\nAmbiance was great. Food tasted amazing. Service was . No complaints at all","date":"2014-02-05 18:07:17"}
{"review_id":"E4LqIZ7DJd_R4ZHSNKx4RQ","user_id":"DoRCeCcJbrsM2BiAKj3trA","business_id":"SU56w479vUfFHsvmvQIf7A","stars":4.0,"useful":7,"funny":5,"cool":6,"text":"So good! They didn't make it to 5 stars due to the prices are a bit high for the amount of food and the location is a bit unsavory. \nThe decor and atmosphere was surprisingly nice, from the outside I expected to be more run down inside. The staff was very nice. We were surprised how empty the dining room was for a Friday evening.\nWe got Vegetable Samosas to start then ordered Chicken Tikka Masala, Lamb Rogan Josh, rice and plain Naan. Our only complaint was the lamb could've been more tender but everything was flavorful and delicious. \nI would definitely go again if given the chance.","date":"2016-07-25 03:55:20"}
{"review_id":"LrO2MkIWIjAoOeS5WImnrQ","user_id":"hzny0aF2jcUaY8rXN2bfJQ","business_id":"CGUK3cd2gxp2q3KPY19Oog","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Yum!! Had the kale grits and would definitely have those again! Menu choices are unique, farm fresh and delicious!","date":"2018-04-15 11:34:34"}
{"review_id":"p9U8-Bj9tFBqHa-wgaDKJg","user_id":"1BcNXW9_Y16TIofPVpFqIA","business_id":"vhIJ91MDgUuk4Cr9Kpj1Nw","stars":1.0,"useful":2,"funny":0,"cool":0,"text":"Dreadful Service\n\nI've had Jimmy John's before several years ago in Minneapolis.. But apparently here in Phoenix, the store personnel must be trained differently. I had to take my sandwich back up to the counter twice to get the thick headed folks working at the one on Camelback at about 16th to get my sandwich the way I wanted it.\n\nI asked for a #10 Hunter's Club with all the veggies. What I got was the standard #10 Hunters Club with lettuce and tomatoes. \n\nAfter seeing that, I took it back up to the counter, and explained that I wanted all the veggies. They explained to me that those were all the veggies the sandwich came with. I carefully explained that I wanted all of the veggies that they have. The guy said, oh, you want the Freebies. I would have thought he would have clarified when I ordered whether I just wanted everything that came on the sandwich, or the Freebies as well. I said yes, I wanted all of the Freebie Veggies. \n\nI took my revised sandwich and sat down to eat it, only to find that along with the veggies I had requested, they had piled on Italian vinaigrette and Dijon mustard, which I did NOT want.","date":"2015-07-16 05:40:33"}
{"review_id":"dS5ERxmIP-CQ_ZV_q_xc0A","user_id":"SYRRQJoa5gQ8Duev4uSWag","business_id":"8KmqWgL0UEdxJFwTZ_YZvQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These burgers are phenomenal! The Galley Boy just melts in your mouth, and paired with the potato teasers and a milkshake it is like heaven on Earth.","date":"2012-12-04 03:30:31"}
{"review_id":"W6VRRz7mVGZLsidyHelHwg","user_id":"To4ATBBNlnC5gzj0dwXfuA","business_id":"EgwGTDZ705TwudPJwAY0yQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"This place is quite possibly my favorite restaurant in Phoenix. \n\nMy favorites are the Chicken Scarpariello, the pizza and the Sangria. My wife can't decide between four dishes. Our daughter loves the Penne ala Vodka, Lasagna, or Ravioli.\n\nMario and his sons work hard to please and we've never had a bad meal here. I've seen them bend over backwards to try and take care of obvious jerks. \n\nPlus to top it off, when local school invited local pizza places to present to a class on making pizza and recycling issues, Mario came and talked to the kids as if they were adults. All the other places treated it as a marketing event and brought coupons. \n\nGet the idea? It's all good at this neighborhood gem!","date":"2011-01-09 00:07:16"}
{"review_id":"yMXmJzpEah6XfS_SSu920A","user_id":"MQq_1AlcDWsyNs7Ot8J4OQ","business_id":"GdCRQU3VCh_x8fY84mbwYQ","stars":5.0,"useful":1,"funny":1,"cool":3,"text":"Man, I love Toronto! Hiding in a strip mall on Overlea, find a dingy looking restaurant that serves up fantastic, cheap kabob...be warned regardless of when you come here you'll likely be waiting for a table as this place is always overrun with people...If you're a fan of perfectly grilled spicy meat, you must try this place out...now that I've been here I need to limit how many times I go here per month :)\n\nTake the drive out and have some kabob...if you don't own a car, borrow one or get a zipcar membership...totally worth it!","date":"2011-02-13 17:46:55"}
{"review_id":"IWinoppaEcMt5DrreAUR0Q","user_id":"U2sN2-HGvh27FyXKFlvkBg","business_id":"qaPSbg690KaX5av6xsSV4Q","stars":1.0,"useful":4,"funny":0,"cool":0,"text":"I have no idea what the owner's problem is, but he's incredibly rude. His wife, on the other hand is super nice (an odd mix).\n\nGreat space, rude owner and the coffee is average.","date":"2013-05-28 20:38:13"}
{"review_id":"P1SXso5nMKwhHyTW6OIIIg","user_id":"OuRmjIT8yj8w04XsLX1tlg","business_id":"9mIm1ef-NVDQHFE39Faxxg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Hey....i just want to say, everytime I eat here, since the late 90's.  Nothing but good wings, good beer, and good times.  If the waiting staff is terrible, slow, non attentive, so be it.  I eventually get my food and beer, im busy either catching up with friends or pull out the cell phone and chat with friends.  Weird but there it is.  Have Fun here..........Cheers!","date":"2018-08-04 20:36:55"}
{"review_id":"niN5qW_M5Y0W0zQEcQcFig","user_id":"n5E4KzRRGosdxNcdyyZztg","business_id":"9nHpqlu7be1466wdo_t5kQ","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"My family and I came in on Wed. Night for dinner we had a party of 6 plus a baby(using a high chair). We had to wait about 10 mins to be seated and when we got to our table it was against the wall, half booth half chairs. My husband asked to sit at another table but the hostess said \"No\" so we had the baby between our table and the customers next to us, luckily she's a great baby!! The table and booth were dirty and floor was sticky, gross, and I had to kick a fork out from under my seat. The service was subpar but the waiter was nice. It took 20 mins for my boys to get their drinks and refills, well they were sparse to say the least. I ordered steamed broccoli which was actually raw when it came out the first time but they, what I believe, microwaved it to warm it up. My poor daughter in law had a charcoal patty which she sent back and it took a good 25-30 mins to be replaced.\nThe worse part is my son has a sensitivity to gluten so he ordered a gluten free bun but they gave him a Ciabatta bun which he didn't realize until he had already eaten half the burger. My husband brought the issues up to the manager but she didn't really contribute anything to the situation other than sending the burnt burger back. The waiter's solution for the inconvenience was a free appetizer card to be redeemed the next time they came in. We live 3 1\/2 hours from Mesa and it's so disappointing to run into this kind of service, this was definitely not a pleasant experience","date":"2018-03-15 20:12:39"}
{"review_id":"oMRfgrni0xBWo5zKaoxD4w","user_id":"CfGtdsu0Npd1Zjx43rXIqQ","business_id":"FStFa2esHFgsAjVzIGJcQA","stars":2.0,"useful":4,"funny":0,"cool":0,"text":"Well they definitely lost me as a customer! RC Willey here I come!\n\nMy father, who is 69 years old, moved out here from Los Angeles the beginning of this month to be closer to me and my kids. I ordered and fully paid for a bedroom set for him. They called me like 4 days before the order was to be delivered to confirm the appointment. I advised the lady that no one was living in my father's apartment yet but if they could call me as they are on their way I could rush down to the place and open the door for them. I mean I live in the same complex so it wouldn't be a long wait! She said she would let the guys know but no promise...okaaaaay? I paid $1,200 for furniture, I am a repeat customer, and you can't make one quick easy courtesy call? Well I missed their delivery and no call was made. I found out from my LANDLORD that they came because they went to the office and he was going to let them in but they said no because someone had to sign the paper. To top it off, when I got my dad's key to check the place out before he arrived, there was a note on the COUNTER that said \"Sorry we Missed you\"....so they entered the apartment and left the note but couldn't put the damn furniture together?? They denied going in but how the hell did the paper get on the counter? Anyway my dad arrived with NO furniture and we had to pay $50.00 for them to deliver the furniture again 3 DAYS LATER. My father has bad arthritis and basically no cartilage in his knees making it very hard for him to get up from low areas such as couches and FLOORS which he almost had to sleep on if it weren't for my friend who let us borrow her air mattress luckily. He still couldn't get up though and crawled to get around his place until I was able to get to his place after work :(. Bottom line, they are not for their customers at all and their attitude after you purchase their crap shows it all. I will never be back.","date":"2014-01-17 00:23:28"}
{"review_id":"Pin7lN2A9XzBVpzgq4-wgQ","user_id":"EYnRRWIOlxKcylR457hSMg","business_id":"Z66xO_B7trDah8F0PKwRqg","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"We stopped by for a little shopping. The mall is nicer than most and has plenty of stores. It was a nice way to spend a few hours before heading on to another adventure.","date":"2018-05-28 20:32:27"}
{"review_id":"485juGN7xennwKdLzToQrw","user_id":"DtuFzGEwdYI5E3vTOMSOsw","business_id":"Nc7cqq5k0WZsVhu25QrmNQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The gang at Sun Valley Stereo is definitely top notch. Ryan gets right to the point and saw what I was interested in, and we worked together to verify that all the parts were in to upgrade my 2004 RX-8 with a Pioneer 4000NEX touchscreen and back-up camera before I drove 90 minutes for the work. When I first left there was some adjustments needed. They took me back in without hesitation and made everything right. The installer was committed to treating my car like it was his own. He took the extra steps to make it all right, and even fixed the hatch door to my 12-volt socket. Now that's going the extra mile! 6-stars!","date":"2015-01-03 22:46:37"}
